import 'package:sqflite/sqflite.dart';

import '../../domain/entities/dua.dart';
import '../../domain/repositories/dua_repository.dart';
import '../datasources/dua_local_datasource.dart';
import '../models/dua_model.dart';

class DuaRepositoryImpl implements DuaRepository {
  final DuaLocalDataSource localDataSource;

  DuaRepositoryImpl({
    required this.localDataSource,
  });

  @override
  Future<List<Dua>> getAllDuas() async {
    return localDataSource.getAllDuas();
  }

  @override
  Future<int> addDua(Dua dua) async {
    final model = DuaModel.fromEntity(dua);

    return localDataSource.insertDua(model);
  }

  @override
  Future<void> updateDua(Dua dua) async {
    final model = DuaModel.fromEntity(dua);

    await localDataSource.updateDua(model);
  }

  @override
  Future<void> deleteDua(int id) async {
    await localDataSource.deleteDua(id);
  }

  @override
  Future<void> updateSortOrder(
      int id,
      int sortOrder,
      ) async {
    await localDataSource.updateSortOrder(
      id,
      sortOrder,
    );
  }

  @override
  @override
  Future<void> seedDefaultDuas() async {
    final hasDuas = await localDataSource.hasDuas();

    if (hasDuas) {
      return;
    }

    final now = DateTime.now();

    const defaultDuasText = '''
يا من يرَى ما في الضميرِ ويسمعُ ... أنتَ المعَدُّ لكلِّ ما يتوقَعُ
يا مَن يُرجَّى للشدائدِ كلِّها ... يا مَنْ إليه المُشتَكَى والمَفْزَعُ
يا مَن خزائنُ مُلكِهِ في قولِ كُنْ ... أُمنُنْ فإنَّ الخيرَ عندَكَ أجمعُ
ما لي سِوَى فَقْرِي إليكَ وسيلةٌ ... فبالافتِقارِ إليكَ فَقْرِيَ أَدْفَعُ
ما لي سِوَى قَرْعِي لبابِك حيلةٌ ... فلئِن رُددتُ فأيَّ بابٍ أقرعُ
ومن الذي أدُعو وأهتفُ باسمِهِ ... إن كانَ فضلُكَ عن فقيرٍ يُمنعُ؟!
حاشَا لمجدِك أن تُقنِّط عاصيًا ... فالفَضْلُ أجزلُ والمواهبُ أوسعُ
-----------------------------------------------------
اللهم حجتي حاجتي..
وعدتي فاقتي..
ووسيلتي انقطاع حيلتي..
ورأس مالي عدم احتيالي..
وشفيعي دموعي.. وكنزي عجزي..
إلهي قطرة من بحار جودك تغنيني..وذرة من تيار عفوك تكفيني..
فارزقني..وعافني..واعفُ عني..واغفر لي..واقض ِ حاجتي..ونفّس كربتي..وفرّج همي..واكشف غمي..
برحمتك يا أرحم الراحمين..
والحمد لله رب العالمين..
-----------------------------------------------------
اللهم ربنا لك الحمد، أنت قيم السموات والأرض، ولك الحمد، أنت رب السماوات والأرض ومن فيهن، ولك الحمد، أنت نور السموات والأرض ومن فيهن، أنت الحق، وقولك الحق، ووعدك الحق، ولقاؤك الحق، والجنة حق، والنار حق، والساعة حق، اللهم لك أسلمت، وبك آمنت، وعليك توكلت، وإليك خاصمت، وبك حاكمت، فاغفر لي ما قدمت وما أخرت، وأسررت وأعلنت، وما أنت أعلم به مني، لا إله إلا أنت
-----------------------------------------------------
اللَّهمَّ إنِّي أسألُك بأنَّ لك الحمدَ، لا إلهَ إلَّا أنت المَنَّانُ، يا بديعَ السمواتِ والأرضِ، يا ذا الجَلالِ والإكرامِ، يا حَيُّ يا قَيُّومُ
-----------------------------------------------------
اللَّهُمَّ إِنِّي أَسْأَلُكَ أَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ، لَا إِلَهَ إِلَّا أَنْتَ، الْأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ
-----------------------------------------------------
اللهم خذ بنواصينا إليك أخذ الكرام عليك
-----------------------------------------------------
اللهم اجعل في قلبي نورًا، وفي لساني نورًا، وفي سمعي نورًا، وفي بصري نورًا، ومن فوقي نورًا، ومن تحتي نورًا، وعن يميني نورًا، وعن شمالي نورًا، واجعل لي نورًا، وعظم لي نورًا.
-----------------------------------------------------
اللهم ارزقنا حبك وقربك ورضاك الذى لا سخط بعده أبدا
-----------------------------------------------------
اللهم انى اسالك الثبات في الأمر والعزيمة على الرشد وأسألك شكر نعمتك وحسن عبادتك وأسألك قلبا سليما ولسانا صادقا وأسألك من خير ماتعلم واعوذ بك من شر ما تعلم واستغفرك لما تعلم إنك أنت علام الغيوب
-----------------------------------------------------
اللهم آت نفوسنا تقواها وزكها أنت خير من زكاها أنت وليها ومولاها
-----------------------------------------------------
اللهم بعلمك الغيب وقدرتك على الخلق أحيني ما علمت الحياة خيرا لى وتوفنى إذا علمت ان الوفاة خيرا لي
اللهم انى اسالك خشيتك في الغيب والشهادة واسالك كلمة الحق في الغضب والرضا
وأسألك القصد في الفقر والغنى وأسألك نعيما لا ينفذ واسالك قرة عين لا تنقطع واسالك الرضا بعد القضاء واسالك برد العيش بعد الموت وأسألك لذة النظر الى وجهك والشوق الى لقائك فى غير ضراء مضرة ولا فتنة مضلة
اللهم زينا بزينة الإيمان واجعلنا هداة مهتدين
-----------------------------------------------------
اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ
-----------------------------------------------------
اللهم لك الحمد كما تقول وخيرا مما نقول لا نحصى ثناء عليك أنت كما اثنيت على نفسك
-----------------------------------------------------
اللهم احسن عاقبتنا كلها
-----------------------------------------------------
اللهم علمنى ما ينفعنى وانفعنى بما علمتنى
-----------------------------------------------------
اللهم انا نعوذ بك من قلب لا يخشع ومن عين لا تدمع ومن نفس لا تشبع ومن دعاء لا يرفع اللهم انا نعوذ بك من هؤلاء الأربع
-----------------------------------------------------
اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ سَمَّيْتَ بِهِ نَفْسَكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الْغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجَلَاءَ حُزْنِي، وَذَهَابَ هَمِّي
-----------------------------------------------------
اللهم انى اسالك موجبات رحمتك وعزائم مغفرتك والسلامة من كل إثم والغنيمة من كل بر
-----------------------------------------------------
اللهم أصلح لى دينى الذى هو عصمة امرى واصلح لى دنياى التى معاشى وأصلح لى آخرتي التي إليها معادي
-----------------------------------------------------
اللهم رب جبريل ورب ميكائيل ورب إسرافيل ربنا ورب كل شئ فالق الحب والنوى فاطر السموات والأرض عالم الغيب والشهادة أنت تحكم بين عبادك فيما كانوا فيه يختلفون اهدني لما اختلف فيه من الحق باذنك انك تهدي من تشاء الى صراط مستقيم
-----------------------------------------------------
ربنا ءاتنا من لدنك رحمة وهيئ لنا من امرنا رشدا
-----------------------------------------------------
اللهم استرنى واجعل تحت الستر ما تحب
-----------------------------------------------------
يا ودود يا ودود ياذا العرش المجيد
نسألك حبك وحب من يحبك وحب كل عمل يقربنا الى حبك
اللهم اجعل حبك أحب إلينا من الماء البارد على الظمأ
-----------------------------------------------------
اللهم ارفع عنا البلاء والوباء والغلاء
-----------------------------------------------------
اللهم افتح لي من أبواب رزقك ما لا يُغلق، ومن أسرار بركتك ما لا يُدرَك
-----------------------------------------------------
اللهم يا فتاح يا عليم، افتح لي أبواب رحمتك وفضلك، وارزقني رزقاً واسعاً، وافتح لي كل باب مُغلق عسرت عليّ فيه الأمور
-----------------------------------------------------
اللهم مالك الملك، تؤتي الملك من تشاء، وتنزع الملك ممن تشاء، وتعز من تشاء، وتذل من تشاء، بيدك الخير، إنك على كل شيء قدير، رحمن الدنيا والآخرة ورحيمهما، تعطيهما من تشاء، وتمنع منهما من تشاء، ارحمني رحمة تغنيني بها عن رحمة من سواك
-----------------------------------------------------
اللهم ارزقني القبول في الأرض والسماء
-----------------------------------------------------
عافنى من العصبية
-----------------------------------------------------
اللهم أظلنا فى ظلك يوم لا ظل إلا ظلك
-----------------------------------------------------
عافنى من جلد الذات وأحلام اليقظة
-----------------------------------------------------
اللهم إني أشكوا إليك ضعف قوّتي وقلة حيلتي وهواني على الناس يا أرحم الراحمين أنت رب المستضعفين وأنت ربي إلى من تكلني إلى بعيد يتجهّمني أو إلى عدوّ ملكته أمري إن لم يكن بك عليّ غضب فلا أبالِ ولكن عافيتك هي أوسع لي، أعوذ بنور وجهك الذي أشرقت له الظلمات، وصلح عليه أمر الدنيا والآخرة، مِن أن تُنزِل بي غضبك أو تُحِلَّ علي سخطك، لك العتبى حتى ترضى، ولا حول ولا قوة إلا بك
-----------------------------------------------------
اللهم لك اسلمت وبك امنت وعليك توكلت واليك انبت وبك خاصمت اللهم أعوذ بعزتك لا اله الا انت ان تضلني انت الحي الذي لا يموت والجن والإنس يموتون
-----------------------------------------------------
اللهم ارزقنا الاخلاص فى القول والعمل
-----------------------------------------------------
اللهم إني أستودعك نفسي وأولادي، فآمِنَّا من كل خوف، وطمئن قلوبنا، واحفظنا بحفظك، واكتب لنا السلامة والعافية والسكينة في الدنيا والآخرة.
-----------------------------------------------------
اللهم ألق علي محبة منك واصنعني على عينك أنا وأولادى
-----------------------------------------------------
اللهم كل من اراد بنا الشر اللهم انا نجعلك فى نحورهم ونعوذ بك من شرورهم
حسبنا الله ونعم الوكيل
وأفوض أمرى الى الله إن الله بصير بالعباد
-----------------------------------------------------
أعوذُ بك من شرِّ سمعِي وشرِّ بصرِي وشرِّ لساني وشرِّ قلبي وشرِّ منيِّي
-----------------------------------------------------
نعوذُ باللهِ من شرورِ أنفسِنا ، ومن سيئاتِ أعمالِنا
-----------------------------------------------------
الاستغفار لمن اغتبتهم أو ظلمتهم أو سخرت منهم أو سبتهم أو حسدتُهم أو أصبتهم بعين
-----------------------------------------------------
اللهم ارزقنا الكف عن أعراض الناس
-----------------------------------------------------
يارب قوينى على أوْرادى
-----------------------------------------------------
اللهم ارزقني قوة الحفظ وسرعة الفهم وصفاء الذهن وثبات العقل
-----------------------------------------------------
اللهم ارزقنا حسن الظن بك
-----------------------------------------------------
اللهم ارزقنا حسن الاتباع فى الدنيا
-----------------------------------------------------
اللهم ارزقنا توبة قبل الممات
-----------------------------------------------------
يا ودود يا ودود، يا ذا العرش المجيد، يا فعالاً لما تريد، أسألك بعزّك الذي لا يُرام، ومُلكك الذي لا يُضام، وبنورك الذي ملأ أركان عرشك، أن تكفيني [شر ما أهمني / أو حاجتك]، يا مغيث أغثني، يا مغيث أغثني، يا مغيث أغثني.
-----------------------------------------------------
اللهم زدنى علما
-----------------------------------------------------
يارب جازى علماءنا ومشايخنا عنا خير الجزاء
اللهم وفقهم لما تحب وترضى
واغفر لهم زلاتهم
وبارك في أعمارهم وعلمهم
و اجمعنا بهم فى الفردوس الأعلى
وارحم ميتهم يارب
-----------------------------------------------------
اللهم حبب الينا الايمان وزينه فى قلوبنا وكره إلينا الكفر والفسوق والعصيان
-----------------------------------------------------
اللهم طهر قلبي من الشح، واجعلني من المتصدقين المفلحين.
-----------------------------------------------------
ربنا أتمم لنا نورنا واغفر لنا
-----------------------------------------------------
ضع يدك على الوجع
بسم الله 3 مرات
أعوذ بعزة الله وقدرته من شر ما اجد واحاذر 7 مرات
بسم الله أرقيك من كل شئ يؤذيك ومن شر كل نفس أو عين حاسد الله يشفيك بسم الله أرقيك
-----------------------------------------------------
اللهم اجعل القرآن حجة لنا لا علينا اللهم ألبسنا به الحلل واسكنا به الظلل وادفع عنا به النقم اللهم انفعنا وارفعنا بالقرآن العظيم
-----------------------------------------------------
اللهم اختم لنا بالباقيات الصالحات أعمالنا
-----------------------------------------------------
اللهم اجعلنا من الذين اتقوا وَإذا مسهم طائف من الشيطان تذكروا فإذا هم مبصرون
-----------------------------------------------------
يارب ارزقنى رزقا واسعا إنك أنت الرزاق وإنك أنت الوهاب
-----------------------------------------------------
اللهم يامعلم ابراهيم علمني اللهم يا مفهم سليمان فهمني
-----------------------------------------------------
رب أعوذ بك من همزات الشياطين واعوذ بك ان يحضرون
-----------------------------------------------------
رب أعني ، ولا تعن علي ، وانصرني ولا تنصر علي ، وامكر لي ولا تمكر علي ، واهدني ويسر الهدى لي ، وانصرني على من بغى علي ، رب اجعلني لك شكارا لك ، ذكارا لك ، رهابا لك ، مطواعا لك ، مخبتا إليك ، أواها منيبا ، تقبل توبتي ، وأجب دعوتي ، واهد قلبي ، وثبت حجتي ، وسدد لساني ، واسلل سخيمة قلبي
-----------------------------------------------------
اللهمَّ اهدِنا فيمَن هدَيت ، وعافِنا فيمَن عافيت وتولَّنا فيمَن تولَّيت ، وباركْ لنا فيما أعطيت ، وقِنا شرَّ ما قضيت ، إنك تَقضي ولا يُقضى عليكَ ، إنه لا يَذِلُّ مَن والَيت ، ولا يَعزُّ مَن عاديت ، تباركت ربَّنا وتعالَيت
-----------------------------------------------------
اللهم اقسم لنا من خشيتك ما تحول به بيننا وبين معصيتك، ومن طاعتك ما تبلغنا به جنتك، ومن اليقين ما تهون به علينا مصائب الدنيا، ومتعنا بأسماعنا وأبصارنا وقوتنا ما أحييتنا، واجعله الوارث منا، واجعل ثأرنا على من ظلمنا، وانصرنا على من عادانا، ولا تجعل مصيبتنا في ديننا، ولا تجعل الدنيا أكبر همنا ولا مبلغ علمنا، ولا تسلط علينا من لا يرحمنا
-----------------------------------------------------
اللهم اغفر لي ذنوبي وخطاياي كلها، اللهم أنعشني واجبرني، واهدني لصالح الأعمال والأخلاق ؛ فإنه لا يهدي لصالحها ولا يصرف سيئها إلا أنت
-----------------------------------------------------
اللهم إني ظلمت نفسي ظلماً كثيراً ولا يغفر الذنوب إلا أنت فاغفر لي مغفرةً من عندك وارحمني إنك أنت الغفور الرحيم
-----------------------------------------------------
اللهم اهدنى وسددنى
-----------------------------------------------------
اللهم اعنا على ذكرك وشكرك وحسن عبادتك
-----------------------------------------------------
اللهم تقبل منا الصيام والقيام وصالح الاعمال
-----------------------------------------------------
اللهم انى اعوذ بك ان ارد الى ارذل العمر
-----------------------------------------------------
اللهم يا مُقلِّبَ القلوبِ والابصار ثبِّت قلبي على دينِك
اللَّهُمَّ مُصَرِّفَ القُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ
-----------------------------------------------------
رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ
-----------------------------------------------------
رب اجعلني مقيم الصلاة ومن ذريتي ربنا وتقبل دعاء
-----------------------------------------------------
رب اجنبني وبني أن نعبد الأصنام
-----------------------------------------------------
اللهم اكفني بحلالك عن حرامك وأغنني بفضلك عمن سواك
-----------------------------------------------------
اللهم إني أسألك الهدى والتقى والعفاف والغنى
-----------------------------------------------------
اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا لاَ أَعْلَمُ
-----------------------------------------------------
اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ ، وَأَعُوذُ بِكَ مِنْكَ ، لَا أُحْصِي ثَنَاءً عَلَيْكَ ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ
-----------------------------------------------------
اللهم إني أعوذ بك من زوال نعمتك وتحول عافيتك وفجاءة نقمتك وجميع سخطك
-----------------------------------------------------
اللهم دبر لنا فإننا لا نُحسن التدبير
-----------------------------------------------------
اللهم أقدر لي الخير حيث كان ثم ارضني به
-----------------------------------------------------
اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبَرَصِ، وَالْجُنُونِ، وَالْجُذَامِ، وَمِنْ سَيِّئِ الأَسْقَامِ
-----------------------------------------------------
اللهم ارنا الحق حقا وارزقنا اتباعه وارنا الباطل باطل وارزقنا اجتنابه
-----------------------------------------------------
اللهم جنبنا الفتن ما ظهر منها وما بطن
-----------------------------------------------------
اللهم إجعل خير عُمري آخره، وخير عملي خواتمه، وخير أيامي يوم ألقاك فيه
-----------------------------------------------------
اللهم ارزقنا الفردوس الأعلى
-----------------------------------------------------
اللهم ارزقنا الشهادة فى سبيلك هناا
-----------------------------------------------------
اللهم ارزقنا حسن الخاتمة
-----------------------------------------------------
اللهم حرم وجوهنا على النار
-----------------------------------------------------
اللهم اجعلنا من اصحاب اليمين
-----------------------------------------------------
اللهم اغفر لنا ذنوبنا وكفر عنا سيئاتنا وتوفنا مع الأبرار
-----------------------------------------------------
اللهم اهدنا وَاهْدِ بِنَا واجعلنا سببًا لِـمن اهْتَدَى
-----------------------------------------------------
اللهم ارزقنا الخشوع فى الصلاة والذكر والدعاء وقراءة القرآن
-----------------------------------------------------
اللهم طهر قلوبنا من الغل والحقد والحسد وطهر ألسنتنا من الغيبة والنميمة والكذب
-----------------------------------------------------
اللهم انصر الإسلام وأعز المسلمين وأعلي بفضلك كلمتي الحق والدين
-----------------------------------------------------
اللهم أبرم لهذه الأمة أمر رشد يعز فيه أهل طاعتك ويهدى فيه أهل معصيتك ويأمر فيه بالمعروف وينهى فيه عن المنكر
-----------------------------------------------------
اللهم اهدنا واهدى شبابنا وبناتنا ونسائنا
-----------------------------------------------------
ربنا هب لنا من أزواجنا وذرياتنا قرة أعين واجعلنا للمتقين إماما
-----------------------------------------------------
اللهم ردنا الى دينك مردا جميلا
-----------------------------------------------------
اللهم كل من اراد الاسلام والمسلمين بشر فاجعل كيده فى نحره واجعل تدبيره تدميره واجعل الدائرة عليه ومن اراد الاسلام والمسلمين بخير فوفقه لكل خير واجعل عز الإسلام على يديه
-----------------------------------------------------
اللهم اشف مرضانا ومرضى المسلمين وارحم موتانا وموتى المسلمين
-----------------------------------------------------
اللهم فرج كرب المكروبين واقض الدين عن المدينين
-----------------------------------------------------
اللهم اغفر للمؤمنين والمؤمنات الاحياء منهم والاموات
-----------------------------------------------------
اللهم اغفر لابى وامى وارحمهما كما ربيانا صغارا
-----------------------------------------------------
اللهم ارزق ابى وامى الفردوس الاعلى
-----------------------------------------------------
اللهم اشرح لى صدرى ويسر لى امرى واحلل عقدة من لسانى يفقهوا قولى
-----------------------------------------------------
يارب اكرمنى بمتابعة العمرة والحج
-----------------------------------------------------
يارب اكرمنا برؤية النبى فى المنام واكرمنا برؤيته على الحوض نشرب من يده الشريفة شربة هنيئة لا نظمأ بعدها ابدا لا
-----------------------------------------------------
اللهم ولى امورنا خيارنا ولا تولى علينا شرارنا
-----------------------------------------------------
رب نجني من القوم الظالمين
-----------------------------------------------------
رب اهدني إلى سواء السبيل
-----------------------------------------------------
اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ مُنْكَرَاتِ الأَخْلَاقِ، وَالأَعْمَالِ، وَالأَهْوَاءِ
-----------------------------------------------------
اللهم إني أسألك فعل الخيرات، وترك المنكرات، وحب المساكين، وأن تغفر لي، وترحمني، وإذا أردت فتنة قوم فتوفني غير مفتون، وأسألك حبك، وحب من يحبك، وحب عمل يقربني إلى حبك
-----------------------------------------------------
اللهمَّ اغفِرْ لي خطيئَتي وجَهلي ، وإسرافي في أمري ، وما أنت أعلمُ به مني ، اللهمَّ اغفرْ لي خطَئي وعَمْدي ، وهَزْلي وجِدِّي ، وكلُّ ذلك عندي ، اللهمَّ اغفرْ لي ما قدَّمتُ وما أخَّرتُ ، وما أسررتُ وما أعلنتُ ، أنت المقدِّمُ وأنت المؤخِّرُ ، وأنت على كلِّ شيء قديرٌ
-----------------------------------------------------
اللهم إني أسألك من الخير كله عاجله وآجله، ما عَلِمْتُ منه وما لم أعلم.
وأعوذ بك من الشر كله عاجله وآجله، ما عَلِمْتُ منه وما لم أعلم.
اللهم إني أسألك الجنة وما قرب إليها من قول أو عمل.
وأعوذ بك من النار وما قرب إليها من قول أو عمل.
اللهم إني أسألك من خير ما سألك منه عبدك ونبيك محمد ﷺ.
وأعوذ بك من شر ما استعاذ منه عبدك ونبيك محمد ﷺ.
اللهم ما قضيت لي من قضاء فاجعل عاقبته لي رشداً
-----------------------------------------------------
اللهم إني أسألك العفو والعافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية: في ديني ودنياي وأهلي ومالي، اللهم استر عوراتي وآمن روعاتي، اللهم احفظني من بين يدي ومن خلفي وعن يميني وعن شمالي ومن فوقي وأعوذ بعظمتك أن أُغتال من تحتي
-----------------------------------------------------
اللهم إنك عفو تحب العفو فاعف عنا
-----------------------------------------------------
اللهم اغفر لى ذنبى ووسع لى فى دارى وبارك لى فيما رزقتنى
-----------------------------------------------------
اللهم إني أعوذُ بكَ منَ الهمِّ والحزَنِ، وأعوذُ بكَ منَ العجزِ والكسلِ، وأعوذُ بكَ منَ الجُبنِ والبخلِ ؛ وأعوذُ بكَ مِن غلبةِ الدَّينِ وقهرِ الرجالِ
-----------------------------------------------------
اللهم إني أعوذ بك من جهد البلاء، ودرك الشقاء، وسوء القضاء، وشماتة الأعداء
-----------------------------------------------------
يا ولِيَّ الإسلامِ وأهلِهِ، مسِّكْنِي بالإسلامِ حتى ألقاكَ عليْهِ
-----------------------------------------------------
يا حي يا قيوم برحمتك أستغيث.. أصلح لي شأني كله ولا تكلني إلى نفسي طرفة عين
-----------------------------------------------------
اللهم فاطر السماوات والأرض، عالم الغيب والشهادة، رب كل شيء ومليكه، أشهد أن لا إله إلا أنت، أعوذ بك من شر نفسي، وشر الشيطان وشركه
-----------------------------------------------------
اللهم ارزقنا حسن التوكل عليك
-----------------------------------------------------
اللهم احفظ قلوبنا من العجب والكبر والرياء
واحفظ أعيننا من الخيانة
-----------------------------------------------------
اللهم جنبنا الكبائر
-----------------------------------------------------
اللهم اصلح لى زوجى
-----------------------------------------------------
اللهمَّ إني أعوذ بك من عذاب جهنم ومن عذاب القبر ومن فتنة المحيا والممات ومن شر فتنة المسيح الدجال
-----------------------------------------------------
اللهم حسن خلقي كما حسنت خلقي
-----------------------------------------------------
اللهم بصرنا بعيوبنا و قنا شح أنفسنا
-----------------------------------------------------
اللهم ربى لنا اولادنا واصلح لنا في ذرياتنا
-----------------------------------------------------
اللهم اشفنى شفاء لا يغادر سقما
-----------------------------------------------------
يارب احفظ اولادى من المتنمرين والمعتدين وصحبة السوء
واحفظهم من الشواذ والشذوذ والجنس والمخدرات
يارب فقهم فى دينك ووفقهم فى دراستهم واجعلهم ذرية صالحة يارب احمى سمعهم وبصرهم
-----------------------------------------------------
اللهم اصلح حالى وأخواتى واقاربى وجيرانى وأصحابى وزمايلى
يارب اهدى اولادنا ووفقهم
يارب زوج بناتنا
يارب اصلح ذات بيننا
يارب فرج كربنا
يارب وسع علينا في أرزاقنا
-----------------------------------------------------
يارب اشفى امى شفاء لا يغادر سقما وارزقها حسن الخاتمة
يارب ارزقها توبة قبل الممات
-----------------------------------------------------
يارب اكرم اولادى بحفظ القرآن وتعلمه والعمل به واكرمنى باتقان القرآن وتعلمه والعمل به
-----------------------------------------------------
الدعاء للمستضعفين والدعاء على بنى ص-ه-ي-و-ن
-----------------------------------------------------
يارب اخترنا واصطفينا كما اخترت واصطفيت أنبيائك
اللهم استعملنا ولا تستبدلنا
اللهم عسلنا
-----------------------------------------------------
اللهم اكفنى شر كل حاسد وحاقد وماكر
-----------------------------------------------------
اللهم لا تجعل فى قلوبنا غلا للذين امنوا
-----------------------------------------------------
اللهم مكن لدينك فى الارض وافتح له قلوب الناس
-----------------------------------------------------
اللهم اربط على قلبى لأكون من المؤمنين
''';

    final defaultDuas = defaultDuasText
        .split('-----------------------------------------------------')
        .map((dua) => dua.trim())
        .where((dua) => dua.isNotEmpty)
        .toList();

    for (int i = 0; i < defaultDuas.length; i++) {
      final dua = DuaModel(
        text: defaultDuas[i],
        sortOrder: i,
        isDefault: true,
        createdAt: now,
        updatedAt: now,
      );

      await localDataSource.insertDua(dua);
    }
  }

  @override
  Future<void> updateAllSortOrders(
      List<Dua> duas,
      ) async {
    final models = duas
        .map(
          (dua) => DuaModel.fromEntity(dua),
    )
        .toList();

    await localDataSource.updateAllSortOrders(
      models,
    );
  }
}